src/DataProcessors/ДобавлениеДокумента/ДобавлениеДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДобавлениеДокумента</name>
  <attributes>
    <name>Маска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Извещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>CatalogRef.Документация</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Catalogs/Документация/Документация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Документация</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Извещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПросмотрДляСЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ДобавлениеДокумента/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьПустуюСсылкуДок()
Возврат(Справочники.Документация.ПустаяСсылка());
КонецФункции	

&НаСервере
Функция СоздатьГруппуДокумента(ИмяКаталога,Родитель)
НайденнаяГруппа = Справочники.Документация.НайтиПоНаименованию(ИмяКаталога,Истина,Родитель);	
	Если НайденнаяГруппа.Пустая() Тогда
	НайденнаяГруппа = Справочники.Документация.СоздатьГруппу();
	НайденнаяГруппа.Родитель = Родитель;
	НайденнаяГруппа.Наименование = ИмяКаталога;
	НайденнаяГруппа.Записать();
	КонецЕсли;
	Возврат(НайденнаяГруппа.Ссылка);
КонецФункции

&НаСервере
Функция СоздатьДокумент(ДокВидДокумента,ДокНаименование,ДокИмяФайла,ДокКомментарий,ДокИзвещение,Родитель)
Док = Справочники.Документация.НайтиПоНаименованию(ДокНаименование,Истина,Родитель);	
	Если Док.Пустая() Тогда
	Док = Справочники.Документация.СоздатьЭлемент();
	Док.Родитель = Родитель;
	Док.ВидДокумента = ДокВидДокумента;
		Если Найти(ДокНаименование,"(") = 1 Тогда
		Код = Сред(ДокНаименование,2,Найти(ДокНаименование,")")-2);
		Док.Код = Число(Код);
		Наименование = СокрЛП(Сред(ДокНаименование,Найти(ДокНаименование,")")+1));
		Иначе	
		Наименование = ДокНаименование;
		КонецЕсли; 
	Док.Наименование = Наименование;
	Док.ИмяФайла = ДокИмяФайла;
	Док.Комментарий = ДокКомментарий;
	Док.Извещение = ДокИзвещение;
	Док.Записать();
	КонецЕсли;
Возврат(Док.Ссылка);
КонецФункции

&НаКлиенте
Процедура ДобавитьДокумент(Команда)
НачКаталог = СокрЛП(ПолучитьКаталогДокументовИПрограмм());	
	Для Каждого Док Из Объект.Документы Цикл
		Если Не Док.Пометка Тогда
		Продолжить;	
		КонецЕсли;		
			Если Не Док.Ссылка.Пустая() Тогда
			Продолжить;	
			КонецЕсли;
				Если Не ЗначениеЗаполнено(Док.ВидДокумента) Тогда
				Сообщить(Док.Наименование+" - не выбран вид документа!");
				Продолжить;
				КонецЕсли; 
	Файл = Новый Файл(Док.ИмяФайла);

	ВыбКаталог = Сред(Файл.Путь,Найти(Файл.Путь,НачКаталог)+СтрДлина(НачКаталог));
	ТекРодитель = ПолучитьПустуюСсылкуДок();
		Пока Найти(ВыбКаталог,"\") > 0 Цикл
		ТекКат = СокрЛП(Лев(ВыбКаталог,Найти(ВыбКаталог,"\")-1)); 
		ТекРодитель = СоздатьГруппуДокумента(ТекКат,ТекРодитель);
		ВыбКаталог = Сред(ВыбКаталог,Найти(ВыбКаталог,"\")+1);
		КонецЦикла;	
	Док.Ссылка = СоздатьДокумент(Док.ВидДокумента,Файл.ИмяБезРасширения,Файл.Имя,Док.Комментарий,Док.Извещение,ТекРодитель);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Док Из Объект.Документы Цикл
	Док.Пометка = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого Док Из Объект.Документы Цикл
	Док.Пометка = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьКаталог(Стр)
	Если Не Стр.ЭтоГруппа Тогда
	Стр = Стр.Родитель;
	КонецЕсли; 
Возврат(ПолучитьТекущийКаталогДоп(Стр.Родитель)+СокрЛП(Стр.Наименование)+"\");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.Маска = "*.*";
Объект.ДатаСоздания = ТекущаяДата();
	Если Параметры.Свойство("Элемент") Тогда
	Элемент = Параметры.Элемент;
		Если Элемент.ЭтоГруппа Тогда
		ТекущаяГруппа = Элемент;
		Объект.Каталог = СокрЛП(ПолучитьКаталог(Элемент));
		Иначе			
		//ВидДокумента = Элемент.ВидДокумента;
		ТекущаяГруппа = Элемент.Родитель;
		Объект.Каталог = СокрЛП(ПолучитьКаталог(Элемент.Родитель));
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьКаталогДокументовИПрограмм()
Возврат(Константы.КаталогДокументовИПрограммДоп.Получить());	
КонецФункции

&НаСервере
Функция ДокументСуществует(ИмяФайла)
Док = Справочники.Документация.НайтиПоРеквизиту("ИмяФайла",ИмяФайла,ТекущаяГруппа);	
Возврат(Не Док.Пустая());	
КонецФункции

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);

Диалог.Заголовок = "Выберите каталог для поиска";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
//Диалог.Каталог = ПолучитьКаталогДокументовИПрограмм()+Объект.Каталог;
Диалог.Каталог = Объект.Каталог;
	Если Диалог.Выбрать() Тогда
	Объект.Каталог = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиФайлыДок(Команда)
Объект.Документы.Очистить();
Состояние("Обработка каталога...",,"Создание списка файлов");
МассивНайденных = НайтиФайлы(Объект.Каталог, Объект.Маска,Истина);
к = 0; 
	Для Каждого Файл из МассивНайденных Цикл	
	ОбработкаПрерыванияПользователя();
	к = к + 1;
	Состояние("Обработка каталога...",к*100/МассивНайденных.Количество(),"Проверка списка файлов (для отмены Ctrl+Break)"); 
		Если Не Файл.ЭтоФайл() Тогда
		Продолжить;		
		КонецЕсли;		
			Если Объект.ИспользоватьДату Тогда
				Если НачалоДня(Файл.ПолучитьВремяИзменения()) <> НачалоДня(Объект.ДатаСоздания) Тогда
				Продолжить;		
				КонецЕсли;				
			КонецЕсли;
				Если ДокументСуществует(Файл.Имя) Тогда
				Продолжить;		
				КонецЕсли;
	Док = Объект.Документы.Добавить();
	Док.ВидДокумента = ВидДокумента;	 
	Док.ИмяФайла = Файл.ПолноеИмя;
	Док.Наименование = Файл.Имя;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ЗначениеЗаполнено(Объект.Каталог) Тогда
	//НайтиФайлыДок(Неопределено);
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДокументыИзвещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

Диалог.Заголовок = "Выберите файл";
	Если ЗначениеЗаполнено(Элементы.Документы.ТекущиеДанные.ИмяФайла) Тогда
	Диалог.ПолноеИмяФайла = Элементы.Документы.ТекущиеДанные.ИмяФайла;
	Иначе	
	Диалог.Каталог = Объект.Каталог;
	КонецЕсли; 
 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;

	Если Диалог.Выбрать() Тогда
	Ф = Новый Файл(Диалог.ВыбранныеФайлы[0]);
	Элементы.Документы.ТекущиеДанные.Извещение = Ф.Имя; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСсылке(Команда)
Ф = ПолучитьФорму("Справочник.Документация.ФормаСписка");
Ф.Открыть();
Ф.Элементы.Список.ТекущаяСтрока = Элементы.Документы.ТекущиеДанные.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

Диалог.Заголовок = "Выберите файл";
	Если ЗначениеЗаполнено(Элементы.Документы.ТекущиеДанные.ИмяФайла) Тогда
	Диалог.ПолноеИмяФайла = Элементы.Документы.ТекущиеДанные.ИмяФайла;
	Иначе	
	Диалог.Каталог = Объект.Каталог;
	КонецЕсли; 
 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;

	Если Диалог.Выбрать() Тогда
	Ф = Новый Файл(Диалог.ВыбранныеФайлы[0]);
	Элементы.Документы.ТекущиеДанные.Наименование = Ф.Имя;
	Элементы.Документы.ТекущиеДанные.ИмяФайла = Ф.ПолноеИмя; 
	КонецЕсли;
КонецПроцедуры
